Revit 2027 API
IFCParameterTemplate.SetInSessionTemplateDocument Method
 Set document for in-session template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetInSessionTemplateDocument(
	Document document
)
Public Sub SetInSessionTemplateDocument (
	document As Document
)
public:
void SetInSessionTemplateDocument(
	Document^ document
)
member SetInSessionTemplateDocument :
        document : Document -> unit
Parameters
document Document
 The Revit document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The template is not an is-session.
Remarks
 The document is used for non built-in parameters mapping.
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace